{
  "title": "Application Procedure for Summer Classes {{year}}",
  "applicationPeriod": "Application period: <0>{{time}}<0/>",
  "step_1": {
    "title": "STEP 1 : Online Application Form",
    "description": "Please follow the steps to complete online application.",
    "login": "1. Log into <0>SAYT Application System</0>. (For first-time user, please register an account with your email. Even you were former EPYMT student, you still need a valid account to login.)",
    "completeForm": "2. Complete the application form.",
    "reminder": "Please be reminded:",
    "reminder_1": "- Former EPYMT students must complete the form at the link under \"Former EPYMT Applicant\" of the online application.",
    "reminder_2": "- Application fee is HK$50 for each EPYMT course.",
    "reminder_3": "- Applicants who apply for more than one course should submit application separately for each course in the same account.",
    "checkStatus": "3. Check application status. Applicants can also login the account to check their course result in the future.",
    "checkEmail": "4. We primarily communicate with you via email, and we kindly encourage you to <0>check your email account regularly</0>. This will ensure that you stay informed and do not miss any important information.",
    "remark": "* It is not necessary to send any supporting documents at this stage."
  },
  "step_2": {
    "title": "STEP 2 : Admission Screening Test",
    "formerStudents": {
      "title": "Former students",
      "description": "Applicants who have successfully completed any EPYMT course may be exempt from the Admission Screening Test and will be directly admitted to their chosen course(s)."
    },
    "localAndOverseasStudents": {
      "title": "Details",
      "description": "All first-time applicants must attend the admission screening test on <0>{{admissionDate}}</0>. Failing to do so will be considered as withdrawing from the application."
    },
    "details": "The screening test is a take-home exam that assesses whether an applicant has acquired sufficient background knowledge to take EPYMT courses. The question paper will be sent to applicants at <0>10:00 on 1 May 2026 (Friday)</0> by email. Answers should be scanned, combined into a single PDF file, and submitted to the link provided in the email before <0>17:00 on 4 May 2026 (Monday)</0>. Late submissions may not be considered."
  }
}
