{
    "section_1": {
        "title": "Preface",
        "content_1": "As Hong Kong gradually moves towards a knowledge-based economy, various sectors of society are increasingly emphasizing higher and deeper learning. Aspiring secondary school students plan to establish a solid academic foundation when entering university, enabling them to apply their knowledge effectively in future careers in research, education, engineering, finance, or management, and to develop their careers in an efficient manner, strategizing and leading innovation. Science students particularly hope to leverage a solid mathematical foundation to excel in technology across various industries. The Department of Mathematics at The Chinese University of Hong Kong has thus attracted many outstanding students, as those in preparatory programmes and teachers are likely aware. These motivated students, whether or not they choose to continue with mathematical research, are eager to take the challenging 'Advanced Courses' offered by the mathematics department to test themselves and seek breakthroughs.",
        "content_2": "The interest of adolescents in mathematics often takes shape during high school, and their mathematical potential becomes evident at this time. The mathematics curriculum and its approaches in secondary school clearly do not satisfy students with exceptional mathematical talent. In light of this, under the initiative and planning of Professor Yau Shing Tung, the Department of Mathematics and the Institute of Mathematical Sciences decided to offer the 'Advanced Courses' series, held three seasons each year. This programme allows outstanding students in mathematics and science to receive guidance from leading scholars in technology, expanding their horizons into higher academic fields. Thanks to the generous donation of Mr. William Benter, who is enthusiastic about mathematics education, the 'Enrichment Programme for Young Mathematics Talents (EPYMT)' has been successfully implemented."
    },
    "section_2":{
        "title": "Inaugural Academic Advisors",
        "content_1": "The concept of the 'EPYMT' draws inspiration from similar programmes around the world and operates according to the formal procedures of The Chinese University of Hong Kong, with content and examinations undergoing rigorous review. The courses offered in this programme are recognized by universities, and students who successfully complete the courses can receive 1–2 credits towards their bachelor’s degree at Chinese University. At the same time, the Department of Mathematics has invited a group of leading scholars to form an Academic Advisory Committee. All founding advisors are renowned scholars, including professors from prestigious universities such as Harvard, MIT, Stanford, and Oxford. They are responsible for oversight to ensure that the standards of graduates and the quality of the courses are internationally recognized, thereby establishing a solid foundation for the programme."
    },
    "section_3": {
        "title": "Programme Features",
        "content_1": "The main target audience for this course is high school students who have a strong interest in and aptitude for mathematics. The subjects do not require extensive theoretical knowledge, but students must possess a proactive attitude towards learning. All courses are taught by professors and lecturers from the Department of Mathematics at the Chinese University of Hong Kong, with ample teaching assistants available to support the students. The programme particularly emphasizes face-to-face interaction between teachers and students, as well as collaboration among students, fostering an environment of mutual encouragement and motivation. Furthermore, each year the department invites guest speakers to give special lectures, allowing students to engage with cutting-edge mathematical research and the applications of mathematics in other fields, broadening their horizons."
    }
}