{
    "courseCode": "Course Code",
    "universityRecognition":{
        "header": "University Recognition",
        "content": "2 credit of CUHK"
    },
    "mediumOfInstruction":{
        "header": "Medium of Instruction",
        "content": "mainly in Cantonese with English course materials"
    },
    "expectedApplicants": {
        "header": "Expected Applicants",
        "content": "Students who are promoting to Secondary 5 or 6, and have good knowledge of algebra."
    },
    "introduction": {
        "header": "Introduction",
        "content": "In the first half, we will cover some basic knowledge in Number Theory, including modular arithmetic and Euler's theorem. Then, we will cover two topics in Number Theory: primality test and primitive root, which are indispensable in studying Cryptography. In the second half, we will explore some applications of Number Theory in Cryptography, including some classical systems such as Vigenere cipher and some modern systems such as DES, RSA, digital signature. We will also briefly discuss Shor's algorithm: a quantum-based algorithm and QKD: a quantum-based cryptosystem."
    },
    "remark": "*This course offers face-to-face lessons on CUHK campus.",
    "application": "Online Application",
    "conditions":{
        "title": "Conditions for Admission Screening Test Exemption",
        "description": "Applicants who satisfy either one of the following conditions may be exempted from Admission Screening Test and will be directly admitted into this course.",
        "note": "*(Those who had taken \"Enrichment Mentoring Mathematics I or II\" still need to sit the Test, but will be considered with priority.)",
        "point_1": "1. Passed in any of the following courses before: Geometric Perspectives of Complex Numbers, Complex Number and Analytical Geometry, and Towards Modern Algebra.",
        "point_2": "2. Being admitted in one of the following courses before: Number Theory and Cryptography, Towards Differential Geometry, Mathematical Analysis, and Understanding Non-Euclidean Geometry.",
        "point_3": "Applicants who have successfully completed any EPYMT course may be exempt from the Admission Screening Test and will be directly admitted to their chosen course(s)."
    }
}