{
    "courseCode": "Course Code",
    "universityRecognition":{
        "header": "University Recognition",
        "content": "2 credit of CUHK"
    },
    "mediumOfInstruction":{
        "header": "Medium of Instruction",
        "content": "mainly in Cantonese with English course materials"
    },
    "expectedApplicants": {
        "header": "Expected Applicants",
        "content": "Senior form students who have distinguished mathematical performance or have taken any previous EPYMT course. Students are expected to have exposure to beginning knowledge of tertiary mathematics."
    },
    "introduction": {
        "header": "Introduction",
        "content": "Starting with special geometric structures of complex plane, students will learn symmetry and conformality on complex transformations; the intriguing correspondence between the complex plane and a sphere; and Mobius transformation. Then students would be introduced to a number of amazing properties of Non-Euclidean Geometry from a modern point of view, including hyper-parallelism, non-Euclidean distance, constant curvature, and hyperbolic trigonometry."
    },
    "remark": "*This course offers face-to-face lessons on CUHK campus.",
    "application": "Online Application",
    "conditions":{
        "title": "Conditions for Admission Screening Test Exemption",
        "description": "Applicants who satisfy either one of the following conditions may be exempted from Admission Screening Test and will be directly admitted into this course.",
        "note": "*(Those who had taken \"Enrichment Mentoring Mathematics I or II\" still need to sit the Test, but will be considered with priority.)",
        "point_1": "1. Passed in any of the following courses before: Geometric Perspectives of Complex Numbers, Complex Number and Analytical Geometry, and Towards Modern Algebra.",
        "point_2": "2. Being admitted in one of the following courses before: Number Theory and Cryptography, Towards Differential Geometry, Mathematical Analysis, and Understanding Non-Euclidean Geometry."
    },
    "outdated": "This page is outdated and the course is no longer offered."
}